Repository: quqi0714/cleanfast-app
Catalog: CleanFastClaude/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: （推荐）
en: (Recommended)
zh_hant: （推薦）

source: %@ 后可以进食
en: Eat at %@
zh_hant: %@ 後可以進食

source: %@，查看说明
en: %@, view details
zh_hant: %@，查看說明

source: %lld 小时
en: %lld h
zh_hant: %lld 小時

source: %lld:%lld（自定义）
en: %lld:%lld (Custom)
zh_hant: %lld:%lld（自訂）

source: 0–2 小时
en: 0–2 hours
zh_hant: 0–2 小時

source: 2–4 小时
en: 2–4 hours
zh_hant: 2–4 小時

source: 4–8 小时
en: 4–8 hours
zh_hant: 4–8 小時

source: 8–12 小时
en: 8–12 hours
zh_hant: 8–12 小時

source: 12 小时+
en: 12 h+
zh_hant: 12 小時+

source: 一个温和的轻断食计时器。 不打卡，不催促，不制造焦虑。 按你的节奏来。
en: A gentle intermittent fasting timer. No streaks. No pressure. No anxiety. At your own pace.
zh_hant: 一個溫和的輕斷食計時器。 不打卡，不催促，不製造焦慮。 按你的節奏來。

source: 上顿饭结束
en: Last meal ended
zh_hant: 上一餐結束

source: 上顿饭结束时间
en: When did your last meal end?
zh_hant: 上一餐結束時間

source: 下一步
en: Next

source: 不会替你开始。 点下「开始断食」后，才开始计时。
en: We won't start for you. The timer begins only after you tap Start fasting.
zh_hant: 不會替你開始。 點下「開始斷食」後，才開始計時。

source: 不打开 App 也能看到当前进度。
en: Glance at your progress without opening the app.
zh_hant: 不打開 App 也能看到目前進度。

source: 不登录，不联网，不收集数据。
en: No login. No network. No data collection.
zh_hant: 不登入，不聯網，不收集資料。

source: 之后也可以在设置里随时更改。
en: You can change this anytime in Settings.
zh_hant: 之後也可以在設定裡隨時更改。

source: 今 日 休 息
en: R E S T I N G T O D A Y

source: 今天
en: Today

source: 今天 %@
en: today %@

source: 明天 %@
en: tomorrow %@

source: 昨天 %@
en: yesterday %@

# %lld月%lld日 %@
source: %1$lld月%2$lld日 %3$@
en: %1$lld/%2$lld %3$@

source: 今天休息
en: Resting today

source: 今天休息一下没关系，明天再继续就好。
en: Resting today is fine — pick it up again tomorrow.
zh_hant: 今天休息一下沒關係，明天再繼續就好。

source: 今天先休息
en: Rest today

source: 今天先休息，准备好了记得回来点击“开始”。
en: Rest today — come back and tap Start when you're ready.
zh_hant: 今天先休息，準備好了記得回來點擊「開始」。

source: 今天先休息，明天会按设定时间自动开始。
en: Rest today — tomorrow's fast will start at your set time.
zh_hant: 今天先休息，明天會按設定時間自動開始。

source: 今天先休息？
en: Take today off?

source: 从你点击开始的那一刻计时
en: Timing starts when you tap Start
zh_hant: 從你點擊開始的那一刻計時

source: 你的断食目标已达成，可以开始温和进食了。
en: Your fasting goal is reached — ease into eating.
zh_hant: 你的斷食目標已達成，可以開始溫和進食了。

source: 使用条款
en: Terms of Use
zh_hant: 使用條款

source: 健康说明
en: Health Notice
zh_hant: 健康說明

source: 先简单设置一下
en: A quick setup
zh_hant: 先簡單設定一下

source: 先选一个节奏
en: Pick a rhythm
zh_hant: 先選一個節奏

source: 关于
en: About
zh_hant: 關於

source: 准 备 中
en: R E A D Y
zh_hant: 準 備 中

source: 准备好了
en: Ready
zh_hant: 準備好了

source: 准备好了，就开始
en: Ready when you are
zh_hant: 準備好了，就開始

source: 准备好了再开始
en: Start when you're ready
zh_hant: 準備好了再開始

source: 分钟
en: Minute
zh_hant: 分鐘

source: 切换方式
en: Switching
zh_hant: 切換方式

source: 到了以后会继续计时。 什么时候结束，由你决定。
en: The timer keeps running past the goal. You decide when to stop.
zh_hant: 到了以後會繼續計時。 什麼時候結束，由你決定。

source: 到了目标，也不催你
en: We won't rush you at the goal
zh_hant: 到了目標，也不催你

source: 到点只提醒，什么时候切换由你决定。
en: Reminds you when time is up — you choose when to switch.
zh_hant: 到點只提醒，什麼時候切換由你決定。

source: 到点后只提醒，不自动切换。 准备好了再轻触进入下一段。
en: Reminds when time's up but won't switch automatically. Tap when you're ready for the next phase.
zh_hant: 到點後只提醒，不自動切換。 準備好了再輕觸進入下一段。

source: 到点后只提醒，由你决定什么时候进入下一段。
en: Reminds you when the time is up — you decide when to advance.
zh_hant: 到點後只提醒，由你決定什麼時候進入下一段。

source: 前天
en: 2 days ago

source: 动用糖原
en: Using glycogen
zh_hant: 動用糖原

source: 取消
en: Cancel

source: 可以随时跳过今天。明天回来就好。
en: Skip today anytime — come back tomorrow.
zh_hant: 可以隨時跳過今天。明天回來就好。

source: 外观
en: Appearance
zh_hant: 外觀

source: 多数人更容易长期坚持，平衡感比较好。
en: A balanced choice most people stick with long-term.
zh_hant: 多數人更容易長期堅持，平衡感比較好。

source: 始于 %@
en: Since %@
zh_hant: 始於 %@

source: 完成
en: Done

source: 小时
en: Hour
zh_hant: 小時

source: 小组件
en: Widgets
zh_hant: 小工具

source: 差不多到时间啦
en: Time's about up
zh_hant: 差不多到時間啦

source: 已回到断食窗口
en: Back to fasting
zh_hant: 已回到斷食視窗

source: 已经完成目标
en: Goal complete
zh_hant: 已經完成目標

source: 已超额
en: Over goal
zh_hant: 已超額

source: 已进入进食窗口
en: Eating window opened
zh_hant: 已進入進食視窗

source: 应用
en: Apply
zh_hant: 套用

source: 建议 %@ 前结束进食
en: Suggest finishing by %@
zh_hant: 建議 %@ 前結束進食

source: 开启提醒
en: Enable reminders
zh_hant: 開啟提醒

source: 开始
en: Start
zh_hant: 開始

source: 开始断食
en: Start fasting
zh_hant: 開始斷食

source: 开始计时
en: Start timer
zh_hant: 開始計時

source: 开始进食
en: Start eating
zh_hant: 開始進食

source: 很简单，按你的节奏来。
en: Simple — at your own pace.
zh_hant: 很簡單，按你的節奏來。

source: 忘记点了？把开始时间调回实际时间就好。
en: Forgot to tap? Just roll the start time back to when it really began.
zh_hant: 忘記點了？把開始時間調回實際時間就好。

source: 恢复今天
en: Resume today
zh_hant: 恢復今天

source: 想休息一下？
en: Need a day off?

source: 慢慢进食
en: Eat slowly
zh_hant: 慢慢進食

source: 我们只在断食或进食目标到达时提醒你。 不会打卡催促，也不会发送多余通知。
en: We only notify when a fasting or eating goal is reached. No streak nags, no extra noise.
zh_hant: 我們只在斷食或進食目標到達時提醒你。 不會打卡催促，也不會發送多餘通知。

source: 手动切换
en: Manual
zh_hant: 手動切換

source: 按你的节奏来，准备好了就开始。
en: Go at your own pace — start when you're ready.
zh_hant: 按你的節奏來，準備好了就開始。

source: 按时间自动切换，打开就知道现在是哪一段。
en: Switches on schedule — open the app to see which window you're in.
zh_hant: 按時間自動切換，打開就知道現在是哪一段。

source: 按设定的断食和进食窗口自动切换。 打开时可以直接看到当前是否在进食窗口。
en: Switches automatically between fasting and eating windows. Open the app to see which one you're in.
zh_hant: 按設定的斷食和進食視窗自動切換。 打開時可以直接看到目前是否在進食視窗。

source: 按设定窗口自动进入下一段，打开时直接看到当前窗口。
en: Advances on its own — open the app to see the current window.
zh_hant: 按設定視窗自動進入下一段，打開時直接看到目前視窗。

source: 推荐
en: Recommended
zh_hant: 推薦

source: 搜「轻断食」→ 选尺寸 → 加上
en: Search "CleanFast" → pick a size → add
zh_hant: 搜尋「輕斷食」→ 選尺寸 → 加上

source: 断 食 进 行 中
en: F A S T I N G
zh_hant: 斷 食 進 行 中

source: 断食 / 进食时长
en: Fasting / Eating Hours
zh_hant: 斷食 / 進食時長

source: 断食中
en: Fasting
zh_hant: 斷食中

source: 断食小时数：%lld
en: Fasting hours: %lld
zh_hant: 斷食小時數：%lld

source: 断食或进食目标达成时会发一条本地通知， 仅此而已。
en: We send one local notification when a fasting or eating goal is reached. That's it.
zh_hant: 斷食或進食目標達成時會發一條本機通知， 僅此而已。

source: 断食窗口
en: Fasting Window
zh_hant: 斷食視窗

source: 断食窗口已经结束，时钟会继续帮你记录这一段。
en: Fasting window ended — the timer keeps logging this phase.
zh_hant: 斷食視窗已經結束，時鐘會繼續幫你記錄這一段。

source: 断食窗口至 %@
en: Fasting until %@
zh_hant: 斷食視窗至 %@

source: 新手友好
en: Beginner
zh_hant: 新手友善

source: 日常推荐
en: Everyday
zh_hant: 日常推薦

source: 日期
en: Date

source: 时钟会按你的设定自动进入下一段。
en: The timer will move to the next phase automatically.
zh_hant: 時鐘會按你的設定自動進入下一段。

source: 明天
en: Tomorrow

source: 明天再继续就好
en: Pick it up again tomorrow
zh_hant: 明天再繼續就好

source: 昨天
en: Yesterday

source: 暂时不用
en: Not now
zh_hant: 暫時不用

source: 极简
en: Minimal
zh_hant: 極簡

source: 查看说明
en: View details
zh_hant: 查看說明

source: 桌面 / 锁屏小组件
en: Home & Lock Screen Widgets
zh_hant: 桌面 / 鎖定畫面小工具

source: 桌面：长按空白处 → 左上角 +
en: Home: long-press blank area → tap + at top-left
zh_hant: 桌面：長按空白處 → 左上角 +

source: 比 12:12 稍集中，日常安排仍然轻松。
en: Tighter than 12:12, still easy to fit into daily life.
zh_hant: 比 12:12 稍集中，日常安排仍然輕鬆。

source: 浅色
en: Light
zh_hant: 淺色

source: 消化中
en: Digesting

source: 深度供能
en: Deep fueling

source: 深色
en: Dark

source: 温和开始
en: Gentle Start
zh_hant: 溫和開始

source: 燃料切换
en: Fuel switching
zh_hant: 燃料切換

source: 版本
en: Version

source: 现在处于进食窗口。 时间到后会自动回到断食窗口。
en: You're in the eating window. It'll switch back to fasting automatically when time's up.
zh_hant: 現在處於進食視窗。 時間到後會自動回到斷食視窗。

source: 现在开始断食
en: Start fasting now
zh_hant: 現在開始斷食

source: 现在是进食窗口
en: Eating window now
zh_hant: 現在是進食視窗

source: 生活也需要弹性
en: Life needs flexibility too
zh_hant: 生活也需要彈性

source: 目标 %lld 小时
en: Goal %lld h
zh_hant: 目標 %lld 小時

source: 目标 %lld 小时（已达成）
en: Goal %lld h (reached)
zh_hant: 目標 %lld 小時（已達成）

source: 目标 %lld:%lld
en: Goal %lld:%lld
zh_hant: 目標 %lld:%lld

source: 目标已经到了。 想继续也可以，身体舒服最重要。
en: Your goal is here. You can keep going — comfort first, always.
zh_hant: 目標已經到了。 想繼續也可以，身體舒服最重要。

source: 短窗计划
en: Short Window
zh_hant: 短窗計畫

source: 稳步适应
en: Steady
zh_hant: 穩步適應

source: 空腹时间更长，适合已经适应 16:8 后再试。
en: Longer fast — try after you're comfortable with 16:8.
zh_hant: 空腹時間更長，適合已經適應 16:8 後再試。

source: 糖原渐少，身体可能逐渐切换到脂肪供能。 这是一个常见的过渡阶段。记得多喝水哦。
en: As glycogen runs low, the body may gradually shift to fat for fuel. This is a common transition. Stay hydrated.
zh_hant: 糖原漸少，身體可能逐漸切換到脂肪供能。 這是一個常見的過渡階段。記得多喝水喔。

source: 经典
en: Classic
zh_hant: 經典

source: 结束后，进入进食窗口
en: After fasting, the eating window starts
zh_hant: 結束後，進入進食視窗

source: 结束断食
en: End fasting
zh_hant: 結束斷食

source: 联系我们
en: Contact
zh_hant: 聯絡我們

source: 胃通常已经排空， 身体可能更多使用糖原储备来供能。记得多喝水哦。
en: Your stomach has typically emptied. The body may now draw more on glycogen stores. Stay hydrated.
zh_hant: 胃通常已經排空， 身體可能更多使用糖原儲備來供能。記得多喝水喔。

source: 脂肪供能变成主要方式， 酮体水平可能在上升。记得多喝水哦。
en: Fat is becoming the primary fuel, and ketone levels may be rising. Stay hydrated.
zh_hant: 脂肪供能變成主要方式， 酮體水平可能在上升。記得多喝水喔。

source: 自动切换
en: Automatic
zh_hant: 自動切換

source: 自定义
en: Custom
zh_hant: 自訂

source: 血糖渐稳
en: Blood sugar settling
zh_hant: 血糖漸穩

source: 计时方式
en: Timing Mode
zh_hant: 計時方式

source: 设置
en: Settings
zh_hant: 設定

source: 语言跟随系统。
en: Language follows your system.
zh_hant: 語言跟隨系統。

source: 请稍候
en: Please wait
zh_hant: 請稍候

source: 调整开始时间
en: Adjust start time
zh_hant: 調整開始時間

source: 超 额 完 成
en: P A S T G O A L
zh_hant: 超 額 完 成

source: 超额完成中
en: Past goal
zh_hant: 超額完成中

source: 跟随系统
en: System
zh_hant: 跟隨系統

source: 跳过今天
en: Skip today
zh_hant: 跳過今天

source: 身体正在处理刚摄入的能量，胰岛素水平较高。 轻松开始就好，记得多喝水哦。
en: Your body is processing the energy you just took in. Ease into it, and remember to stay hydrated.
zh_hant: 身體正在處理剛攝入的能量，胰島素水平較高。 輕鬆開始就好，記得多喝水喔。

source: 轻断食时钟
en: CleanFast
zh_hant: 輕斷食時鐘

source: 轻断食时钟仅用于计时与提醒，不提供医疗建议。 若你有特殊健康情况，或计划进行较长时间断食， 请先咨询专业人士。
en: CleanFast is a timer and reminder — not medical advice. If you have a health condition, or plan to fast for an extended period, please consult a professional first.
zh_hant: 輕斷食時鐘僅用於計時與提醒，不提供醫療建議。 若你有特殊健康狀況，或計畫進行較長時間斷食， 請先諮詢專業人士。

source: 辛苦啦
en: Nicely done

source: 辛苦啦，开始温和进食吧。 少量多次，记得喝水。
en: Nice work — ease into eating. Small portions, sip water.
zh_hant: 辛苦啦，開始溫和進食吧。 少量多次，記得喝水。

source: 辛苦啦，目标已达成。 继续也好，结束也好，听身体的。
en: Nicely done — goal reached. Keep going or wrap up, whichever your body prefers.
zh_hant: 辛苦啦，目標已達成。 繼續也好，結束也好，聽身體的。

source: 达成时提醒我
en: Notify me when reached
zh_hant: 達成時提醒我

source: 达成目标
en: Goal reached
zh_hant: 達成目標

source: 返回
en: Back

source: 还剩
en: Left
zh_hant: 還剩

source: 进 食 已 满
en: W I N D O W F U L L
zh_hant: 進 食 已 滿

source: 进 食 窗 口
en: E A T I N G W I N D O W
zh_hant: 進 食 視 窗

source: 进 食 进 行 中
en: E A T I N G
zh_hant: 進 食 進 行 中

source: 进阶尝试
en: Going Further
zh_hant: 進階嘗試

source: 进食已满
en: Eating complete
zh_hant: 進食已滿

source: 进食开始
en: Eating started
zh_hant: 進食開始

source: 进食开始时间
en: When did your eating start?
zh_hant: 進食開始時間

source: 进食时间已满
en: Eating window full
zh_hant: 進食時間已滿

source: 进食窗口
en: Eating Window
zh_hant: 進食視窗

source: 进食窗口 %lld 小时
en: %lld-hour eating window
zh_hant: 進食視窗 %lld 小時

source: 进食窗口 %lld 小时（已满）
en: %lld-hour eating window (full)
zh_hant: 進食視窗 %lld 小時（已滿）

source: 进食窗口 = 24 − 断食。之后还可以在设置里改。
en: Eating = 24 − fasting. You can change this later in Settings.
zh_hant: 進食視窗 = 24 − 斷食。之後還可以在設定裡改。

source: 进食窗口也会继续计时。 准备好下一轮时，点「现在开始断食」。
en: The eating window keeps timing too. When you're ready for the next round, tap Start fasting now.
zh_hant: 進食視窗也會繼續計時。 準備好下一輪時，點「現在開始斷食」。

source: 进食窗口已满
en: Eating window full
zh_hant: 進食視窗已滿

source: 进食窗口已经结束，新一段断食已经开始。
en: Eating window ended — a new fast has started.
zh_hant: 進食視窗已經結束，新一段斷食已經開始。

source: 进食窗口建议时长已到，准备好就可以开始下一轮断食。
en: Suggested eating window is up — start the next fast when you're ready.
zh_hant: 進食視窗建議時長已到，準備好就可以開始下一輪斷食。

source: 进食窗口建议时长已到。 准备好就可以开始下一轮断食。
en: Your suggested eating window is up. Start the next fast whenever you're ready.
zh_hant: 進食視窗建議時長已到。 準備好就可以開始下一輪斷食。

source: 进食窗口更宽松，适合先建立节奏。
en: Wider eating window — good for building a rhythm.
zh_hant: 進食視窗更寬鬆，適合先建立節奏。

source: 进食窗口至 %@
en: Eating until %@
zh_hant: 進食視窗至 %@

source: 进食窗口较短，建议身体舒服、有经验时再用。
en: Narrow eating window — better when you're experienced and feeling good.
zh_hant: 進食視窗較短，建議身體舒服、有經驗時再用。

source: 选一个适合今天的断食时长。 进食窗口会自动算好。
en: Pick a fasting length for today. The eating window is calculated for you.
zh_hant: 選一個適合今天的斷食時長。 進食視窗會自動算好。

source: 选择切换方式
en: Choose switching mode
zh_hant: 選擇切換方式

source: 选择断食时长
en: Choose fasting length
zh_hant: 選擇斷食時長

source: 选择首页风格
en: Choose home style
zh_hant: 選擇首頁風格

source: 通知
en: Notifications

source: 锁屏：长按表盘空白 → Customize
en: Lock: long-press the clock face → Customize
zh_hant: 鎖定畫面：長按錶盤空白 → 自訂

source: 隐私政策
en: Privacy Policy
zh_hant: 隱私權政策

source: 需要时提醒你
en: Reminders when it matters
zh_hant: 需要時提醒你

source: 预设
en: Preset
zh_hant: 預設

source: 食物逐渐吸收完，胰岛素开始下降， 血糖正在变得平稳。记得多喝水哦。
en: Food is being absorbed, insulin is dropping, and blood sugar is steadying. Stay hydrated.
zh_hant: 食物逐漸吸收完，胰島素開始下降， 血糖正在變得平穩。記得多喝水喔。

source: 首页风格
en: Home Style
zh_hant: 首頁風格
